# REAL DATA FROM JD.COM

rev_1 = '差评！！！跟妈妈买的手机，妈妈不喜欢，退货，京东拒绝退货，理由外壳有划痕！\
我怎么看不到划痕呢？京东你是在用显微镜在看吗？那以后我收货也应该用显微镜来看啰？！\
所以京东不厚道甚至有点坑人，店大欺客吗？！本人第一次遇到拒退的事居然在京东，\
所以以后京东自营的商品一律不买，且不说七天无理由退货都是这样，那售后维修更是扯蛋！！！\
花钱交学费了！'

star_1 = 1

rev_2 = '很垃圾，双卡切换至联通或移动，电信就不能用得关了。但产品介绍中根本就没这样讲，\
反而宣传‘……我主副卡，任意切换’，很不厚道；买前曾留言联系询问过，没人答复，\
回复的都是自动设置的垃圾话。华为的旗舰店不应水准如此低下。'

star_2 = 1

rev_3 = '昨晚十点多下的单，今天上午就收到了，要说京东绝对神速，这一点是我一直在京东购物的理由。\
东西收到后发现有点瑕疵，手机左上角有损伤，而且我记得华为手机背后应该是贴膜的，这个手机没有膜，\
不知道是不是良品，还是被人退货了。送的礼品不少，都还可以用的'

star_3 = 3

rev_4 = '系统3G的运行内存，简单的运行日常软件用的实在是卡，实在是卡.........，物流也太慢。\
之前用的华为p8也是3G的运行内存用着还行。送的贴膜、耳机质量太次，产品质量、系统没有创新，\
产品质量、系统没有创新，本机体验一般，还略有死机现象，只能将就着用。京东快递员态度很好，\
我不在家，让他给我老娘打电话代收的很热情，很尽责！我老娘也是夸他，感谢快递小哥辛苦你了！'

star_4 = 3

rev_5 = '用了几天，续航能力强，玩游戏配置勉强还行吧，615处理器玩起来还是有些卡顿玩王者对比还没i5s好，\
用来看看电视挺好，想玩高端游戏得还是买配置高点的！'

star_5 = 5

rev_6 = '包装里没有保修卡，问了京东，让找华为。华为让我在盒子里找，我拍了照片，确实没有，\
就又让我找京东。京东说打发票可保修，我下载电子发票给华为，半小时后华为又说凭发京也可保修一年。\
最后，保修卡到底在哪，装没装，长什么样，我一无所知。手机刚用两天，还没修呢就为一张小卡片这么扯皮，\
很差的一次购物体验，华为京东售后都很垃圾！'

star_6 = 5

test_list = [(rev_1, star_1), (rev_2, star_2), (rev_3, star_3), 
             (rev_4, star_4), (rev_5, star_5), (rev_6, star_6)
            ]


